import { introduce } from "@/models/introduce";
// import { latestUpdatedAt } from "../../../package.json";

export const introduceData: introduce = {
  contents: [" 웹 서비스 풀스택 개발 전문가를 목표로 다양한 프로젝트와 경험을 쌓아나가고 있습니다. Javascript, jQuery, React.js, Next.js 등을 사용하여 실무에서 프론트 엔드의 전문성을 키웠고, Php, Java, MySQL, AWS, Docker, Linux 등 실무와 사이드 프로젝트 수행으로 기술 향상을 위해 지속적으로 노력하고 있습니다.", "웹 개발자로서 제가 가장 중요시 하는 것은 사용자 경험을 긍정적으로 극대화시키는 웹 애플리케이션을 추구하는 것 입니다. 웹 페이지를 개발 할 때, 사용자의 입장에서 긍정적이고 유의미한 경험을 전달하여 재방문과 기능 활용도를 높이려고 끊임없이 노력합니다. 그 노력의 중의 하나는 기획자와 다양한 커뮤니케이션을 나누는 것입니다. 다양한 회의를 통해 의견을 조율하고 타당한 논리와 근거를 통해 역으로 제안하거나 수정 사항을 건의하기도 합니다.", "이러한 비즈니스 스킬은 저의 가장 큰 장점인 소스코드의 분석력과 파악력을 기초로 발휘됩니다. 빠르게 프로젝트의 본질을 파악함으로써 클라이언트의 추가 요구사항 처리에도 능숙하게 대처하고, 프로그램 오류 및 버그 감소에도 큰 영향력을 끼칩니다. 저의 이러한 업무의 태도는 프로그램 품질 향상과 유지보수의 용이성에도 큰 도움이 된다고 자부합니다. 가치 높은 프로그램 창출을 위해 지속적인 노력으로 성장하고 나아가고 있습니다."],
  latestUpdated: "2024-04-01",
  sign: "JungDahun",
};
